## OpenTofu plan (dns)

<details>
<summary>Show plan</summary>

```terraform

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # digitalocean_record.google_mx will be destroyed
  # (because digitalocean_record.google_mx is not in configuration)
  - resource "digitalocean_record" "google_mx" {
      - domain   = "login.no" -> null
      - flags    = 0 -> null
      - fqdn     = "testmail.login.no" -> null
      - id       = "1788928315" -> null
      - name     = "testmail" -> null
      - port     = 0 -> null
      - priority = 1 -> null
      - ttl      = 1800 -> null
      - type     = "MX" -> null
      - value    = "smtp.google.com." -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[5].digitalocean_domain.example_domains will be destroyed
  # (because module.do_create_domain[5] is not in configuration)
  - resource "digitalocean_domain" "example_domains" {
      - id   = "fadderuka.net" -> null
      - name = "fadderuka.net" -> null
      - ttl  = 1800 -> null
      - urn  = "do:domain:fadderuka.net" -> null
    }

  # module.do_create_domain[5].digitalocean_record.dmarc will be destroyed
  # (because module.do_create_domain[5] is not in configuration)
  - resource "digitalocean_record" "dmarc" {
      - domain   = "fadderuka.net" -> null
      - flags    = 0 -> null
      - fqdn     = "_dmarc.fadderuka.net" -> null
      - id       = "1730821923" -> null
      - name     = "_dmarc" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[5].digitalocean_record.domainkey will be destroyed
  # (because module.do_create_domain[5] is not in configuration)
  - resource "digitalocean_record" "domainkey" {
      - domain   = "fadderuka.net" -> null
      - flags    = 0 -> null
      - fqdn     = "*._domainkey.fadderuka.net" -> null
      - id       = "1730821924" -> null
      - name     = "*._domainkey" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DKIM1; p=" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[5].digitalocean_record.txt will be destroyed
  # (because module.do_create_domain[5] is not in configuration)
  - resource "digitalocean_record" "txt" {
      - domain   = "fadderuka.net" -> null
      - flags    = 0 -> null
      - fqdn     = "fadderuka.net" -> null
      - id       = "1730821921" -> null
      - name     = "@" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=spf1 -all" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[7].digitalocean_domain.example_domains will be destroyed
  # (because module.do_create_domain[7] is not in configuration)
  - resource "digitalocean_domain" "example_domains" {
      - id   = "higlog.no" -> null
      - name = "higlog.no" -> null
      - ttl  = 1800 -> null
      - urn  = "do:domain:higlog.no" -> null
    }

  # module.do_create_domain[7].digitalocean_record.dmarc will be destroyed
  # (because module.do_create_domain[7] is not in configuration)
  - resource "digitalocean_record" "dmarc" {
      - domain   = "higlog.no" -> null
      - flags    = 0 -> null
      - fqdn     = "_dmarc.higlog.no" -> null
      - id       = "1730821899" -> null
      - name     = "_dmarc" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[7].digitalocean_record.domainkey will be destroyed
  # (because module.do_create_domain[7] is not in configuration)
  - resource "digitalocean_record" "domainkey" {
      - domain   = "higlog.no" -> null
      - flags    = 0 -> null
      - fqdn     = "*._domainkey.higlog.no" -> null
      - id       = "1730821882" -> null
      - name     = "*._domainkey" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DKIM1; p=" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[7].digitalocean_record.txt will be destroyed
  # (because module.do_create_domain[7] is not in configuration)
  - resource "digitalocean_record" "txt" {
      - domain   = "higlog.no" -> null
      - flags    = 0 -> null
      - fqdn     = "higlog.no" -> null
      - id       = "1730821878" -> null
      - name     = "@" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=spf1 -all" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[9].digitalocean_domain.example_domains will be destroyed
  # (because module.do_create_domain[9] is not in configuration)
  - resource "digitalocean_domain" "example_domains" {
      - id   = "karrieredagen.it" -> null
      - name = "karrieredagen.it" -> null
      - ttl  = 1800 -> null
      - urn  = "do:domain:karrieredagen.it" -> null
    }

  # module.do_create_domain[9].digitalocean_record.dmarc will be destroyed
  # (because module.do_create_domain[9] is not in configuration)
  - resource "digitalocean_record" "dmarc" {
      - domain   = "karrieredagen.it" -> null
      - flags    = 0 -> null
      - fqdn     = "_dmarc.karrieredagen.it" -> null
      - id       = "1730821883" -> null
      - name     = "_dmarc" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[9].digitalocean_record.domainkey will be destroyed
  # (because module.do_create_domain[9] is not in configuration)
  - resource "digitalocean_record" "domainkey" {
      - domain   = "karrieredagen.it" -> null
      - flags    = 0 -> null
      - fqdn     = "*._domainkey.karrieredagen.it" -> null
      - id       = "1730821897" -> null
      - name     = "*._domainkey" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DKIM1; p=" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[9].digitalocean_record.txt will be destroyed
  # (because module.do_create_domain[9] is not in configuration)
  - resource "digitalocean_record" "txt" {
      - domain   = "karrieredagen.it" -> null
      - flags    = 0 -> null
      - fqdn     = "karrieredagen.it" -> null
      - id       = "1730821879" -> null
      - name     = "@" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=spf1 -all" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[10].digitalocean_domain.example_domains will be destroyed
  # (because module.do_create_domain[10] is not in configuration)
  - resource "digitalocean_domain" "example_domains" {
      - id   = "karrieredagene.it" -> null
      - name = "karrieredagene.it" -> null
      - ttl  = 1800 -> null
      - urn  = "do:domain:karrieredagene.it" -> null
    }

  # module.do_create_domain[10].digitalocean_record.dmarc will be destroyed
  # (because module.do_create_domain[10] is not in configuration)
  - resource "digitalocean_record" "dmarc" {
      - domain   = "karrieredagene.it" -> null
      - flags    = 0 -> null
      - fqdn     = "_dmarc.karrieredagene.it" -> null
      - id       = "1730821915" -> null
      - name     = "_dmarc" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[10].digitalocean_record.domainkey will be destroyed
  # (because module.do_create_domain[10] is not in configuration)
  - resource "digitalocean_record" "domainkey" {
      - domain   = "karrieredagene.it" -> null
      - flags    = 0 -> null
      - fqdn     = "*._domainkey.karrieredagene.it" -> null
      - id       = "1730821913" -> null
      - name     = "*._domainkey" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DKIM1; p=" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[10].digitalocean_record.txt will be destroyed
  # (because module.do_create_domain[10] is not in configuration)
  - resource "digitalocean_record" "txt" {
      - domain   = "karrieredagene.it" -> null
      - flags    = 0 -> null
      - fqdn     = "karrieredagene.it" -> null
      - id       = "1730821912" -> null
      - name     = "@" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=spf1 -all" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[14].digitalocean_domain.example_domains will be destroyed
  # (because module.do_create_domain[14] is not in configuration)
  - resource "digitalocean_domain" "example_domains" {
      - id   = "loginlf.it" -> null
      - name = "loginlf.it" -> null
      - ttl  = 1800 -> null
      - urn  = "do:domain:loginlf.it" -> null
    }

  # module.do_create_domain[14].digitalocean_record.dmarc will be destroyed
  # (because module.do_create_domain[14] is not in configuration)
  - resource "digitalocean_record" "dmarc" {
      - domain   = "loginlf.it" -> null
      - flags    = 0 -> null
      - fqdn     = "_dmarc.loginlf.it" -> null
      - id       = "1730821918" -> null
      - name     = "_dmarc" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[14].digitalocean_record.domainkey will be destroyed
  # (because module.do_create_domain[14] is not in configuration)
  - resource "digitalocean_record" "domainkey" {
      - domain   = "loginlf.it" -> null
      - flags    = 0 -> null
      - fqdn     = "*._domainkey.loginlf.it" -> null
      - id       = "1730821916" -> null
      - name     = "*._domainkey" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DKIM1; p=" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[14].digitalocean_record.txt will be destroyed
  # (because module.do_create_domain[14] is not in configuration)
  - resource "digitalocean_record" "txt" {
      - domain   = "loginlf.it" -> null
      - flags    = 0 -> null
      - fqdn     = "loginlf.it" -> null
      - id       = "1730821917" -> null
      - name     = "@" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=spf1 -all" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[18].digitalocean_domain.example_domains will be destroyed
  # (because module.do_create_domain[18] is not in configuration)
  - resource "digitalocean_domain" "example_domains" {
      - id   = "logntnu.com" -> null
      - name = "logntnu.com" -> null
      - ttl  = 1800 -> null
      - urn  = "do:domain:logntnu.com" -> null
    }

  # module.do_create_domain[18].digitalocean_record.dmarc will be destroyed
  # (because module.do_create_domain[18] is not in configuration)
  - resource "digitalocean_record" "dmarc" {
      - domain   = "logntnu.com" -> null
      - flags    = 0 -> null
      - fqdn     = "_dmarc.logntnu.com" -> null
      - id       = "1730821886" -> null
      - name     = "_dmarc" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[18].digitalocean_record.domainkey will be destroyed
  # (because module.do_create_domain[18] is not in configuration)
  - resource "digitalocean_record" "domainkey" {
      - domain   = "logntnu.com" -> null
      - flags    = 0 -> null
      - fqdn     = "*._domainkey.logntnu.com" -> null
      - id       = "1730821903" -> null
      - name     = "*._domainkey" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=DKIM1; p=" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain[18].digitalocean_record.txt will be destroyed
  # (because module.do_create_domain[18] is not in configuration)
  - resource "digitalocean_record" "txt" {
      - domain   = "logntnu.com" -> null
      - flags    = 0 -> null
      - fqdn     = "logntnu.com" -> null
      - id       = "1730821876" -> null
      - name     = "@" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "TXT" -> null
      - value    = "v=spf1 -all" -> null
      - weight   = 0 -> null
    }

  # module.do_create_domain["agni.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "agni.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.do_create_domain["agni.no"].digitalocean_record.default will be created
  + resource "digitalocean_record" "default" {
      + domain = "agni.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "209.38.52.30"
    }

  # module.do_create_domain["agni.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "agni.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["agni.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "agni.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["agni.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "agni.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain[0].digitalocean_domain.example_domains has moved to module.do_create_domain["cyberdagen.net"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "cyberdagen.net"
        name = "cyberdagen.net"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["cyberdagen.net"] has moved to module.do_create_domain["cyberdagen.net"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994626"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[0].digitalocean_record.dmarc has moved to module.do_create_domain["cyberdagen.net"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821951"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[0].digitalocean_record.domainkey has moved to module.do_create_domain["cyberdagen.net"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821950"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[0].digitalocean_record.txt has moved to module.do_create_domain["cyberdagen.net"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821952"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[1].digitalocean_domain.example_domains has moved to module.do_create_domain["cyberdagen.no"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "cyberdagen.no"
        name = "cyberdagen.no"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["cyberdagen.no"] has moved to module.do_create_domain["cyberdagen.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994628"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[1].digitalocean_record.dmarc has moved to module.do_create_domain["cyberdagen.no"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821881"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[1].digitalocean_record.domainkey has moved to module.do_create_domain["cyberdagen.no"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821892"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[1].digitalocean_record.txt has moved to module.do_create_domain["cyberdagen.no"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821891"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[2].digitalocean_domain.example_domains has moved to module.do_create_domain["cyberdagene.net"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "cyberdagene.net"
        name = "cyberdagene.net"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["cyberdagene.net"] has moved to module.do_create_domain["cyberdagene.net"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994634"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[2].digitalocean_record.dmarc has moved to module.do_create_domain["cyberdagene.net"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821926"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[2].digitalocean_record.domainkey has moved to module.do_create_domain["cyberdagene.net"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821927"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[2].digitalocean_record.txt has moved to module.do_create_domain["cyberdagene.net"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821925"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[3].digitalocean_domain.example_domains has moved to module.do_create_domain["cyberdagene.no"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "cyberdagene.no"
        name = "cyberdagene.no"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["cyberdagene.no"] has moved to module.do_create_domain["cyberdagene.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994625"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[3].digitalocean_record.dmarc has moved to module.do_create_domain["cyberdagene.no"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821908"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[3].digitalocean_record.domainkey has moved to module.do_create_domain["cyberdagene.no"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821906"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[3].digitalocean_record.txt has moved to module.do_create_domain["cyberdagene.no"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821910"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain["darlinglinjeforening.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "darlinglinjeforening.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.do_create_domain["darlinglinjeforening.no"].digitalocean_record.default will be created
  + resource "digitalocean_record" "default" {
      + domain = "darlinglinjeforening.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "209.38.52.30"
    }

  # module.do_create_domain["darlinglinjeforening.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "darlinglinjeforening.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["darlinglinjeforening.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "darlinglinjeforening.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["darlinglinjeforening.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "darlinglinjeforening.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain[4].digitalocean_domain.example_domains has moved to module.do_create_domain["fadderuka.com"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "fadderuka.com"
        name = "fadderuka.com"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["fadderuka.com"] has moved to module.do_create_domain["fadderuka.com"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994623"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[4].digitalocean_record.dmarc has moved to module.do_create_domain["fadderuka.com"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821900"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[4].digitalocean_record.domainkey has moved to module.do_create_domain["fadderuka.com"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821877"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[4].digitalocean_record.txt has moved to module.do_create_domain["fadderuka.com"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821888"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[6].digitalocean_domain.example_domains has moved to module.do_create_domain["fadderuka.org"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "fadderuka.org"
        name = "fadderuka.org"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["fadderuka.org"] has moved to module.do_create_domain["fadderuka.org"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994621"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[6].digitalocean_record.dmarc has moved to module.do_create_domain["fadderuka.org"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821890"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[6].digitalocean_record.domainkey has moved to module.do_create_domain["fadderuka.org"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821904"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[6].digitalocean_record.txt has moved to module.do_create_domain["fadderuka.org"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821896"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain["ingalinjeforeningen.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "ingalinjeforeningen.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.do_create_domain["ingalinjeforeningen.no"].digitalocean_record.default will be created
  + resource "digitalocean_record" "default" {
      + domain = "ingalinjeforeningen.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "209.38.52.30"
    }

  # module.do_create_domain["ingalinjeforeningen.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "ingalinjeforeningen.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["ingalinjeforeningen.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "ingalinjeforeningen.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["ingalinjeforeningen.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "ingalinjeforeningen.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain[8].digitalocean_domain.example_domains has moved to module.do_create_domain["karrieredag.no"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "karrieredag.no"
        name = "karrieredag.no"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["karrieredag.no"] has moved to module.do_create_domain["karrieredag.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994620"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[8].digitalocean_record.dmarc has moved to module.do_create_domain["karrieredag.no"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821949"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[8].digitalocean_record.domainkey has moved to module.do_create_domain["karrieredag.no"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821948"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[8].digitalocean_record.txt has moved to module.do_create_domain["karrieredag.no"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821947"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[11].digitalocean_domain.example_domains has moved to module.do_create_domain["linjeforeningen.it"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "linjeforeningen.it"
        name = "linjeforeningen.it"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["linjeforeningen.it"] has moved to module.do_create_domain["linjeforeningen.it"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994630"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[11].digitalocean_record.dmarc has moved to module.do_create_domain["linjeforeningen.it"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821911"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[11].digitalocean_record.domainkey has moved to module.do_create_domain["linjeforeningen.it"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821909"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[11].digitalocean_record.txt has moved to module.do_create_domain["linjeforeningen.it"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821914"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain["lnga.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "lnga.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.do_create_domain["lnga.no"].digitalocean_record.default will be created
  + resource "digitalocean_record" "default" {
      + domain = "lnga.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "209.38.52.30"
    }

  # module.do_create_domain["lnga.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "lnga.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["lnga.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "lnga.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["lnga.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "lnga.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain["lngalinjeforening.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "lngalinjeforening.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.do_create_domain["lngalinjeforening.no"].digitalocean_record.default will be created
  + resource "digitalocean_record" "default" {
      + domain = "lngalinjeforening.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "209.38.52.30"
    }

  # module.do_create_domain["lngalinjeforening.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "lngalinjeforening.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["lngalinjeforening.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "lngalinjeforening.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["lngalinjeforening.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "lngalinjeforening.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain[12].digitalocean_domain.example_domains has moved to module.do_create_domain["login-ntnu.no"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "login-ntnu.no"
        name = "login-ntnu.no"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["login-ntnu.no"] has moved to module.do_create_domain["login-ntnu.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994635"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[12].digitalocean_record.dmarc has moved to module.do_create_domain["login-ntnu.no"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821871"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[12].digitalocean_record.domainkey has moved to module.do_create_domain["login-ntnu.no"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821875"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[12].digitalocean_record.txt has moved to module.do_create_domain["login-ntnu.no"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821905"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[13].digitalocean_domain.example_domains has moved to module.do_create_domain["login.coffee"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "login.coffee"
        name = "login.coffee"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["login.coffee"] has moved to module.do_create_domain["login.coffee"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994622"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[13].digitalocean_record.dmarc has moved to module.do_create_domain["login.coffee"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821920"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[13].digitalocean_record.domainkey has moved to module.do_create_domain["login.coffee"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821922"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[13].digitalocean_record.txt has moved to module.do_create_domain["login.coffee"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821919"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain["login.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "login.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.do_create_domain["login.no"].digitalocean_record.default will be created
  + resource "digitalocean_record" "default" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "209.38.52.30"
    }

  # module.do_create_domain["login.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["login.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["login.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain[15].digitalocean_domain.example_domains has moved to module.do_create_domain["loginlf.no"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "loginlf.no"
        name = "loginlf.no"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["loginlf.no"] has moved to module.do_create_domain["loginlf.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994631"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[15].digitalocean_record.dmarc has moved to module.do_create_domain["loginlf.no"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821898"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[15].digitalocean_record.domainkey has moved to module.do_create_domain["loginlf.no"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821895"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[15].digitalocean_record.txt has moved to module.do_create_domain["loginlf.no"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821894"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[16].digitalocean_domain.example_domains has moved to module.do_create_domain["loginntnu.no"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "loginntnu.no"
        name = "loginntnu.no"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["loginntnu.no"] has moved to module.do_create_domain["loginntnu.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994632"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[16].digitalocean_record.dmarc has moved to module.do_create_domain["loginntnu.no"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821893"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[16].digitalocean_record.domainkey has moved to module.do_create_domain["loginntnu.no"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821889"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[16].digitalocean_record.txt has moved to module.do_create_domain["loginntnu.no"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821887"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[17].digitalocean_domain.example_domains has moved to module.do_create_domain["logintnu.no"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "logintnu.no"
        name = "logintnu.no"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["logintnu.no"] has moved to module.do_create_domain["logintnu.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994637"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[17].digitalocean_record.dmarc has moved to module.do_create_domain["logintnu.no"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821874"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[17].digitalocean_record.domainkey has moved to module.do_create_domain["logintnu.no"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821880"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[17].digitalocean_record.txt has moved to module.do_create_domain["logintnu.no"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821902"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain["logntnu.com"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "logntnu.com"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # digitalocean_record.default["logntnu.com"] has moved to module.do_create_domain["logntnu.com"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994629"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain["logntnu.com"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "logntnu.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["logntnu.com"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "logntnu.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["logntnu.com"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "logntnu.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain["logntnu.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "logntnu.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.do_create_domain["logntnu.no"].digitalocean_record.default will be created
  + resource "digitalocean_record" "default" {
      + domain = "logntnu.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "209.38.52.30"
    }

  # module.do_create_domain["logntnu.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "logntnu.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["logntnu.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "logntnu.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["logntnu.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "logntnu.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain["logout.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "logout.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # digitalocean_record.default["logout.no"] has moved to module.do_create_domain["logout.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994624"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain["logout.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "logout.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["logout.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "logout.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["logout.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "logout.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

  # module.do_create_domain[19].digitalocean_domain.example_domains has moved to module.do_create_domain["ntnulogin.no"].digitalocean_domain.example_domains
    resource "digitalocean_domain" "example_domains" {
        id   = "ntnulogin.no"
        name = "ntnulogin.no"
        # (2 unchanged attributes hidden)
    }

  # digitalocean_record.default["ntnulogin.no"] has moved to module.do_create_domain["ntnulogin.no"].digitalocean_record.default
    resource "digitalocean_record" "default" {
        id       = "1759994627"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[19].digitalocean_record.dmarc has moved to module.do_create_domain["ntnulogin.no"].digitalocean_record.dmarc
    resource "digitalocean_record" "dmarc" {
        id       = "1730821885"
        name     = "_dmarc"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[19].digitalocean_record.domainkey has moved to module.do_create_domain["ntnulogin.no"].digitalocean_record.domainkey
    resource "digitalocean_record" "domainkey" {
        id       = "1730821901"
        name     = "*._domainkey"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain[19].digitalocean_record.txt has moved to module.do_create_domain["ntnulogin.no"].digitalocean_record.txt
    resource "digitalocean_record" "txt" {
        id       = "1730821884"
        name     = "@"
        # (9 unchanged attributes hidden)
    }

  # module.do_create_domain["tekkom.no"].digitalocean_domain.example_domains will be created
  + resource "digitalocean_domain" "example_domains" {
      + id   = (known after apply)
      + name = "tekkom.no"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.do_create_domain["tekkom.no"].digitalocean_record.default will be created
  + resource "digitalocean_record" "default" {
      + domain = "tekkom.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "209.38.52.30"
    }

  # module.do_create_domain["tekkom.no"].digitalocean_record.dmarc will be created
  + resource "digitalocean_record" "dmarc" {
      + domain = "tekkom.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "_dmarc"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s; rua=mailto:tekkom.login@gmail.com"
    }

  # module.do_create_domain["tekkom.no"].digitalocean_record.domainkey will be created
  + resource "digitalocean_record" "domainkey" {
      + domain = "tekkom.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*._domainkey"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=DKIM1; p="
    }

  # module.do_create_domain["tekkom.no"].digitalocean_record.txt will be created
  + resource "digitalocean_record" "txt" {
      + domain = "tekkom.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 -all"
    }

Plan: 48 to add, 0 to change, 25 to destroy.
```

</details>